package com.qianfeng.maotuananimation.BaseInterface.model.bean;

import java.util.List;

/**
 * Created by Administrator on 2016/11/8 0008.
 */

public class FaceBean {
    /**
     * need_tips : true
     * list : [{"id":"73958","name":"海贼萌萌窝●∀●","desc":"海贼萌萌窝欢迎海迷们加入本团(ฅ>ω<*ฅ)\n本团收入所有爱海贼的海迷们！！本团聊路飞聊索大聊娜美聊山治聊乔巴聊罗宾各种聊！！快快参与吧！还有美图福利哦~","tips":["山治","娜美","索隆","路飞","海贼王"],"create_time":"1428764905","total":"200","cur_num":"9","icon":"http://haomee.b0.upaiyun.com/haomee/1429972509595.jpg","level":"1","owner":"700205","member":",73725,702982,691491,302498,836930,479043,383135,826411","hx_id":"1428799825733266","member_content":"|||哈哈哈！！\n爱死海贼王！！|||海贼王我是当定了|||壮哉我大海贼 (๑\u2022̀ㅂ\u2022́)و✧|||。","last_day":"2015-05-02","active_day":"5","rec_list":"0","pic":"http://haomee.b0.upaiyun.com/haomee/1428802593000.jpg","superscript":"","city":"请求坐标指示！","location_x":"0","location_y":"0","new_tips":[],"level_tips":["漫娃","漫民","漫臣","漫王","漫皇"],"is_member":false,"danmu":["Bitter Depths加入了团，热烈欢迎~","呵","悲しみ。寂しい。。。加入了团，热烈欢迎~","我来了哈","估计有","有副团长的职位吗(｡✪\u203f✪｡) ﾉ\u201d","美風ブルー加入了团，热烈欢迎~","_:(´ཀ`｀」∠):_ ","[真心话问答]\n如果,现在就是世界末日,只有你的生命才可拯救地球,你会怎么做?\n>>我先来回答","有","有人吗","呵呵","额","更新好慢真心觉得(╬￣皿￣)凸 ","？？","？","谁在","什么鬼","欢迎欢迎","额","中午好～～","哎金木加入了团，热烈欢迎~","好","晚上","私聊哦","拜拜","拜拜，我下了！","传到团相册里去(๑\u2022̀ㅂ\u2022́)و✧","分享点美图？","嘿嘿","祝贺","下个月生日","12","我12","几岁？","你多大了","\n我也是","简单就好","不希望","[真心话问答]\n希望自己未来的另一半是一个名人么？\n>>我先来回答","爸爸","[真心话问答]\n假如可以缩小5cm你希望改变身体的那个部分？\n>>我先来回答","[真心话问答]\n今天穿什么颜色的袜子\n>>我先来回答","[真心话问答]\n你最希望谁叫你起床？\n>>我先来回答","海贼也不错","(｡✪\u203f✪｡) ﾉ\u201d","结界师","其次？","忍者最爱","逗比","日漫","你都看过啥","[真心话问答]\n你是高冷还是逗比（●\u2032Ｉ｀●）\n>>我先来回答","因为日漫被禁","因为要毕业和同学们分开","[真心话问答]\n上一次哭是因为什么？\n>>我先来回答","文化部好可恶！","不","好多","还有火影忍者前600多集","网上传文化部要将海贼王前500多集禁播","此话怎讲？","海贼王要被禁了","嗯","时间之塔加入了团，热烈欢迎~","总比国漫要好","还可以","？","你","我还行","你喜欢日漫？","说什么日漫含色情，黄色啥啥啥的","4.17","为甚？","好多人都传","不知","我去","你不知道吗？","神马？","(〒︿〒)","文化部要把日漫禁了"," ༼ꉺɷꉺ༽ ༼ꉺɷꉺ༽ ༼ꉺɷꉺ༽ ༼ꉺɷꉺ༽ ༼ꉺɷꉺ༽","●﹏●","\u2026\u2026","草泥马","✧*｡٩(ˊᗜˋ*)و✧*｡","没一个人愿意","不愿意","(๑╹ω╹๑)","[真心话问答]\n如果让你活一千年，但是体形外貌变得丑陋不堪；请问你愿意吗？\n>>我先来回答","呵","(๑\u2022́ ∀ \u2022̀๑) ","٩(\u2022̤̀ᵕ\u2022̤́๑)ᵒᵏᵎᵎᵎᵎ","(๑\u2022́ ∀ \u2022̀๑) ","才怪","嗯呀，","你们认识吗","大家好","没下过。","有(๑\u2022̀ㅂ\u2022́)و✧"],"distance":"ta迷路啦！"},{"id":"66887","name":"彡\u2014\"初音未来","desc":"熄灭色彩，撤走声音，只留下我甜蜜的荷尔蒙在你的黑白世界里久久不散。。。。。。","tips":["型月帝国","声优CV","主题曲OP","cosplay","JIS艺术"],"create_time":"1424758663","total":"500","cur_num":"243","icon":"http://haomee.b0.upaiyun.com/haomee/1437607807578.jpg","level":"4","owner":"548874","member":",272770,26622,1512588,472017,1213857,659525,1236218,542982,479594,224456,119094,567767,576011,604736,1468804,390622,583887,291173,628196,956462,609485,1414099,508476,1528624,507407,1480637,440785,1099929,573417,1532627,415635,837340,160322,534863,1033201,709128,575955,1229096,997565,583296,692024,547675,1488269,858405,489247,1094305,1466438,494977,1114264,1330596,1531139,1423166,305345,1190555,214350,24919,247431,1511754,1315394,1552886,865449,581923,970735,693742,1152649,575175,998250,59269,588091,549369,1250149,867460,506660,577859,512566,901193,1530159,1562464,471800,637245,829431,1148786,1474717,262449,610801,1125195,484171,1041860,680518,189425,1527,556272,471293,1555949,472070,1170782,319505,67627,1103214,37788,332050,438181,585453,146410,783695,489947,581629,572047,1234206,612199,511593,1424380,742797,1176733,521618,70262,1517840,527791,1296011,74221,1050297,1555828,862057,1281766,259473,749285,1099979,954173,536811,331954,1410936,134738,1453714,1077343,812493,554370,97067,1518110,557549,1108438,472871,446113,1152236,261358,1162254,651347,1512807,1109354,189736,1488850,1555136,96161,575729,461059,1464787,568980,556311,1123112,16007,1068820,218446,19363,1482146,625158,431671,1423325,1514976,997689,1210524,157246,860012,1059120,506612,1455915,192305,645129,325532,130930,549423,530094,31653,256809,659612,121167,1503912,143104,1065611,549095,39565,571429,1478895,1560103,1318122,1145561,1469875,591803,901427,970399,589966,1531146,492185,572455,998064,510143,1419267,510158,1116607,470870,185689,1353199,290782,656407,1523857,816815,420105,1383991,1130936,410661,555793,930115,173931,1268363,918179,729862,694213,476489,509003,389437,454428,470174,92985,416582,1565236,571330,1376076,564851,177486,1569626,1572173,1576618,75751,1578400","hx_id":"1424759053108326","member_content":"|||一秒八字，相当活跃，有萝莉，有帅哥。还有很多初音。|||我，得了一种病，那就是如果这个团不加我，我便会死亡，，，，|||我是时间啊|||呵呵，我是秦授","last_day":"2016-11-02","active_day":"298","rec_list":"0","pic":"http://haomee.b0.upaiyun.com/haomee/1429312097722.jpg","superscript":"http://manhua.tmcdn.net/nuantuan/708.png","city":"徐州市铜山区","location_x":"34.43394","location_y":"117.018362","new_tips":[],"level_tips":["漫娃","漫民","漫臣","漫王","漫皇"],"is_member":false,"danmu":["嗨呀，好气呀","初临雨季加入了团，热烈欢迎~","大概是脚本・ω・","这么效率","枫铃加入了团，热烈欢迎~",".加入了团，热烈欢迎~","[真心话问答]\n请用纯洁的词语来形容黄色\n>>我先来回答","[真心话问答]\n在恋爱之中做过什么疯狂的事情？\n>>我先来回答","[真心话问答]\n你的动漫本命是谁？\n>>我先来回答","[真心话问答]\n每天睡觉前都会想起的人是谁？\n>>我先来回答","[真心话问答]\n现在和你在一起的，是你的初恋么？\n>>我先来回答","[真心话问答]\n在公共场合，你放了个屁，你会怎样缓解尴尬的气氛？\n>>我先来回答","[真心话问答]\n上一次哭是因为什么？\n>>我先来回答","[真心话问答]\n所有动漫中的武器，你最想得到的是哪一个?\n>>我先来回答","[真心话问答]\n【来撕！】竞技体育的乐趣在于比拼技巧还是比拼体力？\n>>我先来回答","[真心话问答]\n希望自己未来的另一半是一个名人么？\n>>我先来回答","[真心话问答]\n在公共场合，你放了个屁，你会怎样缓解尴尬的气氛？\n>>我先来回答","[真心话问答]\n你的第一个QQ网名是什么\n>>我先来回答","[真心话问答]\n让你一直念念不忘的人是谁？原因呢？\n>>我先来回答","是非对错，谁能無过加入了团，热烈欢迎~","是可以原谅的＼(^ω^＼","只要你的错是太帅了","呸","你们好，我有什么错误还请你们多多宽容","闫文文(宇鸣)加入了团，热烈欢迎~","...","在星空之下加入了团，热烈欢迎~","谁有好看的动漫","I  Iove  you加入了团，热烈欢迎~","AS3000加入了团，热烈欢迎~","咱来了","嗨","有人吗？","没人我放毒了","有人没","愿一切安好加入了团，热烈欢迎~","樱花马卡龙加入了团，热烈欢迎~","人呢？",">w<","夜半诡歌加入了团，热烈欢迎~","新人冒泡","琉璃加入了团，热烈欢迎~","恶魔的女王----JOKER加入了团，热烈欢迎~","[真心话问答]\n【来撕！】竞技体育的乐趣在于比拼技巧还是比拼体力？\n>>我先来回答","15815727878加入了团，热烈欢迎~","图像太帅了真刷不出来加入了团，热烈欢迎~","有","有人没有","天天想加入了团，热烈欢迎~","求好看动漫","hi，有人吗","你也好啊","你好啊","嗨","嗨","炎发灼眼加入了团，热烈欢迎~","°繽紛的纏綿、@加入了团，热烈欢迎~","果断打卡","啊啊啊啊","\u2026\u2026","有人在吗","你们好啊","哈喽","小胖不萌加入了团，热烈欢迎~","改变灬myself加入了团，热烈欢迎~","人","有没有关你们屁事","有人么","「C」加入了团，热烈欢迎~","我也是","有人吗?","大家好","15710929206加入了团，热烈欢迎~","O.O😊","有没有人","衫＆故人加入了团，热烈欢迎~","叶 · 璃加入了团，热烈欢迎~","😳","→_→","Snaky.hirdne加入了团，热烈欢迎~","贝紫真加入了团，热烈欢迎~","多多指教谢谢","王者加入了团，热烈欢迎~","好","大家好","灵灵折ＸＱＱ加入了团，热烈欢迎~","18583857456加入了团，热烈欢迎~","面包汽水加入了团，热烈欢迎~","\u201c雨   忆\u201d加入了团，热烈欢迎~","欢迎哦","哟","18811829982加入了团，热烈欢迎~","hi","。。。。。。","eff加入了团，热烈欢迎~","火是风儿吹开的花加入了团，热烈欢迎~","coccca-加入了团，热烈欢迎~","●_●","不喜欢。。。","●_●"],"distance":"1303.2 km"},{"id":"71448","name":"走吧！","desc":"是时候提着行李告别这里。\n是时候扶着墙壁转身离去。\n是时候对着动漫微微一笑。\n是时候。。。。。。\n我想是时候对大家说再见了。\n对不起，米娜！","tips":["轻小说","小清新","校园","动漫","音乐"],"create_time":"1427110386","total":"500","cur_num":"54","icon":"http://haomee.b0.upaiyun.com/haomee/1428839369622.jpg","level":"4","owner":"302822","member":",996146,704690,1445147,98474,544770,911704,619287,1432285,763020,28022,659382,1023088,383148,1137155,564957,471902,158300,576607,198367,566984,1017998,128274,991758,1447140,695887,830088,1141392,332050,706538,192421,623535,456138,707213,717487,700255,672187,143486,685411,713440,709954,616174,1008425,200736,661297,822767,865609,1430584,1444277,536291,490424,1018514,697613,645530","hx_id":"142711324743129","member_content":"|||了|||刚吧路蝶死~|||加油|||支持","last_day":"2016-06-16","active_day":"76","rec_list":"0","pic":"http://haomee.b0.upaiyun.com/haomee/1428839641577.jpg","superscript":"","city":"温州市文成县","location_x":"27.788046","location_y":"120.092209","new_tips":[],"level_tips":["漫娃","漫民","漫臣","漫王","漫皇"],"is_member":false,"danmu":["冒泡","血浅丶逗比加入了团，热烈欢迎~","你好","0.0","´◡ *佳柔✲ﾟ*加入了团，热烈欢迎~","。。","恩","好梦","你也一样哦","嗯嗯，好哒","早点休息，嘻嘻","嗯嗯","嗯哪","安","安，好梦","晚安","嗯嗯","早点休息","去睡了88","嗯","好闲","嗯嗯","好吧","今晚没事下载下来，回来看看","快一年没有回猫团了吧","搜嘎","哦哦","快一年了","好久没回来看看了","早","早","0.0","欢迎","「墨丿颜』加入了团，热烈欢迎~","无痕wzk加入了团，热烈欢迎~","没什么可说的加入了团，热烈欢迎~","杯子爱情 NAKED HEA加入了团，热烈欢迎~","无敌小裤裤加入了团，热烈欢迎~","☞╭(╯ε╰)╮☜加入了团，热烈欢迎~","一句君无戏言妾愿等千年加入了团，热烈欢迎~","早安","额","拜拜","跪求！！！","各位，有木有刀剑神域二的资源","嗨","欢迎","泪伤加入了团，热烈欢迎~","妄想\u203b稅♪加入了团，热烈欢迎~","欢迎","陌路情殇ぴ加入了团，热烈欢迎~","有人吗","绕命","我踩","好的，我踩","骚年一枚不必理睬","哎呦，你谁咧","。。。","都走了哎","哦？","芒目","。。。","你是由衣","都没人了","唉","猫团改了之后，聊天人好少","我想没有吧","啊哈哈哈","有没有好看的动漫介绍","哈哈","发错了","哈哈","哈哈","好","明非好","哦哈哟","早上好各位","无聊好","嗯呢","我是无聊","😷记下了","额","表示非常不熟悉","欢迎欢迎","嗯","新人报道\u2026\u2026","香消玉损加入了团，热烈欢迎~","呵呵","欢迎欢迎","无聊加入了团，热烈欢迎~"," 有人露头吗","有人吗",".","😄","澡"," Σ(( つ\u2022̀ω\u2022́)つ","谢谢","额","(๑\u2022́ ∀ \u2022̀๑)","呃"],"distance":"850.5 km"},{"id":"76407","name":"驀雪，亦成詩","desc":"时间，能经历很多事，亦明白很多理；能证明很多事。欢迎加Q群191264692","tips":["聊天","天然呆","谈人生","御宅族","S属性"],"create_time":"1430522261","total":"500","cur_num":"392","icon":"http://haomee.b0.upaiyun.com/haomee/1439217985199.jpg","level":"4","owner":"131021","member":",1553442,813594,1084400,40965,984398,1526274,1063735,396304,1356545,197663,981932,562004,1067274,1046149,1001487,1439797,655196,1014457,1344439,6187,950113,937586,340733,661714,862217,136157,1216615,1370516,900374,1092886,968799,635616,1210614,281437,1061967,508716,157097,1385480,552126,1126115,1082859,465620,1116729,568856,715924,1350947,1069479,913921,1076252,1242200,1010313,859978,1443618,1554667,1244399,1525172,542890,450683,763859,205343,1256685,30460,151402,924553,74560,1366935,1339633,1327558,1340028,1161716,20284,1106241,808354,1335426,474638,662960,993474,1236823,559531,1067233,1125237,1479876,1366446,54520,1012730,1367883,1372626,1189649,711735,866822,1398047,1511754,1140692,662073,995682,966777,1079080,672352,434121,754191,1208899,1248148,936616,493275,1277600,1227288,1532746,1533131,660084,1505763,900056,934690,980534,361397,1252507,1203777,579174,687600,1332911,1056152,562766,471800,1471150,567006,1333513,1471974,1240040,1501126,1531140,1223661,1110448,565125,1405034,1188082,1524760,341283,1205075,1177102,1087680,1148399,1449846,581746,1313594,1365868,587121,967134,522511,474032,1062706,679643,164885,605699,597027,970377,1021311,1492724,1177245,1273618,1350954,1458883,533272,774796,965516,876820,1105351,1228346,1489434,1379221,136581,966487,875488,1356908,1226703,155743,672020,1327613,535171,1441834,381375,1356595,1184870,212868,321708,332050,928443,1386002,179634,1080095,688718,428616,1047105,1321745,1297051,101993,355711,1135333,123540,986887,97306,1297082,1242145,624164,951887,462169,1146976,328914,383639,945494,1203520,949429,195220,114698,487461,1529012,1464746,1499386,1425421,996797,107313,558868,1259953,703422,909875,1289217,1301476,1159747,1029035,1105429,1377180,373219,1380533,1081512,383591,1142782,321453,647994,862600,1152451,1262462,1391330,1270642,993822,685452,494917,1202288,910355,896627,1097749,1071355,910308,1174431,971356,1522133,856328,1178756,415470,867990,1062252,928560,215180,696583,944555,715875,938386,68381,1066436,10104,1001424,501121,1273441,346084,1353748,1348660,1489364,844911,1165050,942156,229755,799201,933363,234189,1172671,808858,673018,104868,1412581,1063949,1011389,1229003,1131049,1037744,352546,74302,1149018,719021,148608,504752,1372666,1166346,1201097,1011641,949852,1353811,263558,848889,325224,1364586,1444245,1212806,1080443,112941,1448289,1041959,99749,583071,1251968,1410820,1121408,1390921,1027576,1086179,1404988,1015493,1165057,1347127,1153987,1255637,1260748,968368,1225237,1204284,1419267,1401694,173498,597308,162742,1014972,396098,1188896,1510541,930632,1094037,252702,1099364,1413640,152785,934272,993136,23102,826537,1126549,20034,245173,1046898,1455979,899988,929187,918179,1244043,1114252,930416,1036537,1129221,606045,1068484,1087169,247819,1435194,1238882,1420453,937279,590947,1039448,462072,1191542,1056229,1108697,1363481,1011867,626155,336304,1291847,360435,191110,1558395,508109,1562404,1565236,1565816,1570773,1569741","hx_id":"1430528162448984","member_content":"|||加油↖(^ω^)↗我支持你|||。。|||加油咯，(๑\u2022ั็ω\u2022็ั๑)|||好","last_day":"2016-11-05","active_day":"434","rec_list":"0","pic":"http://haomee.b0.upaiyun.com/haomee/1432940947145.jpg","superscript":"http://manhua.tmcdn.net/nuantuan/634.png","city":"无锡市宜兴市","location_x":"31.366491","location_y":"119.836828","new_tips":[],"level_tips":["漫娃","漫民","漫臣","漫王","漫皇"],"is_member":false,"danmu":["，","[真心话问答]\n你是主动型还是被动型的？\n>>我先来回答","[真心话问答]\n希望有自己的公司成为霸道总裁，还是想被霸道总裁看好走上成功之路？\n>>我先来回答","[真心话问答]\n你最难以改变的习惯是什么？\n>>我先来回答","[真心话问答]\n发生在你身上最糗的事是什么？\n>>我先来回答","[真心话问答]\n希望有自己的公司成为霸道总裁，还是想被霸道总裁看好走上成功之路？\n>>我先来回答","[真心话问答]\n在恋爱之中做过什么疯狂的事情？\n>>我先来回答","[真心话问答]\n一年里最喜欢什么节日？\n>>我先来回答","斩赤红之瞳","・ω・","为什么北极熊不吃企鹅","几个月没有冒泡了","ll加入了团，热烈欢迎~","[真心话问答]\n你经常交往的朋友，年纪比你大些还是小些？\n>>我先来回答","[真心话问答]\n我和你恋人同时约你，你会陪谁？\n>>我先来回答","有人吗？","Hi","NanLin.加入了团，热烈欢迎~","。","卸载好久了，进来看看","15253796065加入了团，热烈欢迎~","I  Iove  you加入了团，热烈欢迎~","咳咳咳。。。。。。","。。。。","！","梦尘加入了团，热烈欢迎~","好吧，是我输了","额","乍的","怎么那么多群，都有你呢？","😂😂😂😂","干嘛","1837384456","我加了那么多，结果只有你","不然还是谁","怎么还是你呢？","不确定","只有你吗？","呃呃","没人的地方","欢迎来到这个什么地方","😳😳😳😳","我宣布，官方及有可能已经放弃猫团了","。。。。","。。。。","想看的自己进去，qq群号码：99463457","群资源吓人","签到","→_→","就不能出来说说话吗？","欢迎"," 夜染、繁华处加入了团，热烈欢迎~","欢迎新人","彤加入了团，热烈欢迎~","～","晚安","晚安","哦","晚安了各位","一点😓","再玩到1点睡觉","哦","嗯～","呵呵","估计他睡觉了","我也困了","额","@仓纤纠大哥等我，我陪你来了。","哎","我也想改","名字不能乱改呀","年少轻狂","。","哈哈哈哈","赤岭","要不然我早改了","野子","嗯","都一样～","嗯～","你也改不了？","。。。","掉线了","都改不了了","嗯","我改不了名字","头像也是","我后悔了","这个名字是上次回猫团乱改的","我好像换名字","呃","吶～","看见了","图片太帅真刷不出来是谁呀","我会看见","。。。。","就可以看见自己的和翼的头像","喵～","嗯","嗯"],"distance":"1114.9 km"},{"id":"77894","name":"就是这个！！大本命火影参上~","desc":"没有什么特别的简介！！！只因喜欢而喜欢      爱动漫！聊吧~","tips":["动漫   二次元   cosplay   宅    腐"],"create_time":"1431536973","total":"300","cur_num":"24","icon":"http://haomee.b0.upaiyun.com/haomee/1431536734370.jpg","level":"2","owner":"988484","member":",687814,813594,530507,722244,759831,986373,876779,792002,988644,990435,1014406,1098637,122704,1093499,980398,582731,1103262,321978,37002,1097441,919293,843146,1017494","hx_id":"143157932520892","member_content":"|||自创。真～火遁！地狱电磁火|||。。。。|||创团成功，聊天愉快|||\u2026\u2026","last_day":"2015-11-23","active_day":"29","rec_list":"0","pic":"http://haomee.b0.upaiyun.com/haomee/1431536705706.jpg","superscript":"","city":"请求坐标指示！","location_x":"0","location_y":"0","new_tips":[],"level_tips":["漫娃","漫民","漫臣","漫王","漫皇"],"is_member":false,"danmu":["没人啊～～","有人在么？？","T-T","[真心话问答]\n你最希望二次元的谁和你结婚或者同床共枕呢？\n>>我先来回答","[真心话问答]\n在自己最爱的人面前做过最囧的事是什么。\n>>我先来回答","欢迎～","拔凉拔凉加入了团，热烈欢迎~","你好","欢迎～","忧伤的孤加入了团，热烈欢迎~","大家早上好","欢迎～","海-风-漂-洋加入了团，热烈欢迎~","你们人呢？","额","欢迎～","晚安_我的芭蕾舞丶加入了团，热烈欢迎~","有人在否？","欢迎欢迎～热烈欢迎～>w<","我加入了团，热烈欢迎~","欢迎欢迎～热烈欢迎～^o^","大焕子是喵喵酱加入了团，热烈欢迎~","各位早上好～^o^","79487","额嘿哟","屿柠加入了团，热烈欢迎~","欢迎欢迎～热烈欢迎～^o^","唔"," ↣悲涼的夜〒_〒加入了团，热烈欢迎~","大家下午好^o^","啊勒没人吗","hi","(๑\u2022̀ㅂ\u2022́)و✧","欢迎欢迎～热烈欢迎～^o^","约你加入了团，热烈欢迎~","。。。。。。。。。。","大家好","嘿嘿"," ♪(^∇^*)","谢谢^_^","欢迎大家^o^","嗨","阿修罗加入了团，热烈欢迎~","审判冷酷的我加入了团，热烈欢迎~","童赫亚加入了团，热烈欢迎~","V  .加入了团，热烈欢迎~","黎i加入了团，热烈欢迎~","欢迎～^o^","绾青丝。加入了团，热烈欢迎~","欢迎～^o^","头像..真拽加入了团，热烈欢迎~","有→_→","[真心话问答]\n有没有幻想过自己是后宫片的男主角？\n>>我先来回答","٩(\u2022̤̀ᵕ\u2022̤́๑)ᵒᵏᵎᵎᵎᵎ","早上好！接我自创的玉！超大螺旋丸","大家晚上好！^o^","大家早上好^o^","早～^o^","好的","晚上好呀^_^","欢迎欢迎～","光辉加入了团，热烈欢迎~","叫你柠檬？可否^_^","欢迎欢迎～","柠檬加入了团，热烈欢迎~","都快出来冒泡吧～^o^","大家下午好～"],"distance":"ta迷路啦！"}]
     * last_id : 5
     * have_next : true
     */

    private boolean need_tips;
    private String last_id;
    private boolean have_next;
    /**
     * id : 73958
     * name : 海贼萌萌窝●∀●
     * desc : 海贼萌萌窝欢迎海迷们加入本团(ฅ>ω<*ฅ)
     本团收入所有爱海贼的海迷们！！本团聊路飞聊索大聊娜美聊山治聊乔巴聊罗宾各种聊！！快快参与吧！还有美图福利哦~
     * tips : ["山治","娜美","索隆","路飞","海贼王"]
     * create_time : 1428764905
     * total : 200
     * cur_num : 9
     * icon : http://haomee.b0.upaiyun.com/haomee/1429972509595.jpg
     * level : 1
     * owner : 700205
     * member : ,73725,702982,691491,302498,836930,479043,383135,826411
     * hx_id : 1428799825733266
     * member_content : |||哈哈哈！！
     爱死海贼王！！|||海贼王我是当定了|||壮哉我大海贼 (๑•̀ㅂ•́)و✧|||。
     * last_day : 2015-05-02
     * active_day : 5
     * rec_list : 0
     * pic : http://haomee.b0.upaiyun.com/haomee/1428802593000.jpg
     * superscript :
     * city : 请求坐标指示！
     * location_x : 0
     * location_y : 0
     * new_tips : []
     * level_tips : ["漫娃","漫民","漫臣","漫王","漫皇"]
     * is_member : false
     * danmu : ["Bitter Depths加入了团，热烈欢迎~","呵","悲しみ。寂しい。。。加入了团，热烈欢迎~","我来了哈","估计有","有副团长的职位吗(｡✪\u203f✪｡) ﾉ\u201d","美風ブルー加入了团，热烈欢迎~","_:(´ཀ`｀」∠):_ ","[真心话问答]\n如果,现在就是世界末日,只有你的生命才可拯救地球,你会怎么做?\n>>我先来回答","有","有人吗","呵呵","额","更新好慢真心觉得(╬￣皿￣)凸 ","？？","？","谁在","什么鬼","欢迎欢迎","额","中午好～～","哎金木加入了团，热烈欢迎~","好","晚上","私聊哦","拜拜","拜拜，我下了！","传到团相册里去(๑\u2022̀ㅂ\u2022́)و✧","分享点美图？","嘿嘿","祝贺","下个月生日","12","我12","几岁？","你多大了","\n我也是","简单就好","不希望","[真心话问答]\n希望自己未来的另一半是一个名人么？\n>>我先来回答","爸爸","[真心话问答]\n假如可以缩小5cm你希望改变身体的那个部分？\n>>我先来回答","[真心话问答]\n今天穿什么颜色的袜子\n>>我先来回答","[真心话问答]\n你最希望谁叫你起床？\n>>我先来回答","海贼也不错","(｡✪\u203f✪｡) ﾉ\u201d","结界师","其次？","忍者最爱","逗比","日漫","你都看过啥","[真心话问答]\n你是高冷还是逗比（●\u2032Ｉ｀●）\n>>我先来回答","因为日漫被禁","因为要毕业和同学们分开","[真心话问答]\n上一次哭是因为什么？\n>>我先来回答","文化部好可恶！","不","好多","还有火影忍者前600多集","网上传文化部要将海贼王前500多集禁播","此话怎讲？","海贼王要被禁了","嗯","时间之塔加入了团，热烈欢迎~","总比国漫要好","还可以","？","你","我还行","你喜欢日漫？","说什么日漫含色情，黄色啥啥啥的","4.17","为甚？","好多人都传","不知","我去","你不知道吗？","神马？","(〒︿〒)","文化部要把日漫禁了"," ༼ꉺɷꉺ༽ ༼ꉺɷꉺ༽ ༼ꉺɷꉺ༽ ༼ꉺɷꉺ༽ ༼ꉺɷꉺ༽","●﹏●","\u2026\u2026","草泥马","✧*｡٩(ˊᗜˋ*)و✧*｡","没一个人愿意","不愿意","(๑╹ω╹๑)","[真心话问答]\n如果让你活一千年，但是体形外貌变得丑陋不堪；请问你愿意吗？\n>>我先来回答","呵","(๑\u2022́ ∀ \u2022̀๑) ","٩(\u2022̤̀ᵕ\u2022̤́๑)ᵒᵏᵎᵎᵎᵎ","(๑\u2022́ ∀ \u2022̀๑) ","才怪","嗯呀，","你们认识吗","大家好","没下过。","有(๑\u2022̀ㅂ\u2022́)و✧"]
     * distance : ta迷路啦！
     */

    private List<ListBean> list;

    public boolean isNeed_tips() {
        return need_tips;
    }

    public void setNeed_tips(boolean need_tips) {
        this.need_tips = need_tips;
    }

    public String getLast_id() {
        return last_id;
    }

    public void setLast_id(String last_id) {
        this.last_id = last_id;
    }

    public boolean isHave_next() {
        return have_next;
    }

    public void setHave_next(boolean have_next) {
        this.have_next = have_next;
    }

    public List<ListBean> getList() {
        return list;
    }

    public void setList(List<ListBean> list) {
        this.list = list;
    }

    public static class ListBean {
        private String id;
        private String name;
        private String desc;
        private String create_time;
        private String total;
        private String cur_num;
        private String icon;
        private String level;
        private String owner;
        private String member;
        private String hx_id;
        private String member_content;
        private String last_day;
        private String active_day;
        private String rec_list;
        private String pic;
        private String superscript;
        private String city;
        private String location_x;
        private String location_y;
        private boolean is_member;
        private String distance;
        private List<String> tips;
        private List<?> new_tips;
        private List<String> level_tips;
        private List<String> danmu;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getDesc() {
            return desc;
        }

        public void setDesc(String desc) {
            this.desc = desc;
        }

        public String getCreate_time() {
            return create_time;
        }

        public void setCreate_time(String create_time) {
            this.create_time = create_time;
        }

        public String getTotal() {
            return total;
        }

        public void setTotal(String total) {
            this.total = total;
        }

        public String getCur_num() {
            return cur_num;
        }

        public void setCur_num(String cur_num) {
            this.cur_num = cur_num;
        }

        public String getIcon() {
            return icon;
        }

        public void setIcon(String icon) {
            this.icon = icon;
        }

        public String getLevel() {
            return level;
        }

        public void setLevel(String level) {
            this.level = level;
        }

        public String getOwner() {
            return owner;
        }

        public void setOwner(String owner) {
            this.owner = owner;
        }

        public String getMember() {
            return member;
        }

        public void setMember(String member) {
            this.member = member;
        }

        public String getHx_id() {
            return hx_id;
        }

        public void setHx_id(String hx_id) {
            this.hx_id = hx_id;
        }

        public String getMember_content() {
            return member_content;
        }

        public void setMember_content(String member_content) {
            this.member_content = member_content;
        }

        public String getLast_day() {
            return last_day;
        }

        public void setLast_day(String last_day) {
            this.last_day = last_day;
        }

        public String getActive_day() {
            return active_day;
        }

        public void setActive_day(String active_day) {
            this.active_day = active_day;
        }

        public String getRec_list() {
            return rec_list;
        }

        public void setRec_list(String rec_list) {
            this.rec_list = rec_list;
        }

        public String getPic() {
            return pic;
        }

        public void setPic(String pic) {
            this.pic = pic;
        }

        public String getSuperscript() {
            return superscript;
        }

        public void setSuperscript(String superscript) {
            this.superscript = superscript;
        }

        public String getCity() {
            return city;
        }

        public void setCity(String city) {
            this.city = city;
        }

        public String getLocation_x() {
            return location_x;
        }

        public void setLocation_x(String location_x) {
            this.location_x = location_x;
        }

        public String getLocation_y() {
            return location_y;
        }

        public void setLocation_y(String location_y) {
            this.location_y = location_y;
        }

        public boolean isIs_member() {
            return is_member;
        }

        public void setIs_member(boolean is_member) {
            this.is_member = is_member;
        }

        public String getDistance() {
            return distance;
        }

        public void setDistance(String distance) {
            this.distance = distance;
        }

        public List<String> getTips() {
            return tips;
        }

        public void setTips(List<String> tips) {
            this.tips = tips;
        }

        public List<?> getNew_tips() {
            return new_tips;
        }

        public void setNew_tips(List<?> new_tips) {
            this.new_tips = new_tips;
        }

        public List<String> getLevel_tips() {
            return level_tips;
        }

        public void setLevel_tips(List<String> level_tips) {
            this.level_tips = level_tips;
        }

        public List<String> getDanmu() {
            return danmu;
        }

        public void setDanmu(List<String> danmu) {
            this.danmu = danmu;
        }
    }
}
